Raziz1/STM32F767ZI_Driver/drivers/Src/STM32F767ZI_i2c_driver.c
		}
		else if(IRQNumber >= 64 && IRQNumber < 96) //64 to 95
		{
			//Program register ISER2 register
			*NVIC_ISER2 |= (1 << (IRQNumber % 64));

		}
		else if(IRQNumber >= 96 && IRQNumber < 128) //96 to 127
		{
			//Program register ISER3 register
			*NVIC_ISER3 |= (1 << (IRQNumber % 128));
		}
	}
	else
	{
		if (IRQNumber <= 31)
		{
			//Program register ICER0 register
			*NVIC_ICER0 |= (1 << IRQNumber);
		}
		else if(IRQNumber > 31 && IRQNumber < 64) //32 to 63
		{
			//Program register ICER1 register
			*NVIC_ICER1 |= (1 << (IRQNumber % 32));

		}
		else if(IRQNumber >= 64 && IRQNumber < 96) //64 to 95
		{
			//Program register ICER2 register
			*NVIC_ICER2 |= (1 << (IRQNumber % 64));

		}
		else if(IRQNumber >= 96 && IRQNumber < 128) //96 to 127
		{
			//Program register ICER3 register
			*NVIC_ICER3 |= (1 << (IRQNumber % 128));
		}
	}
}


/****************************************************************
 * @fn					- I2C_IRQPriorityConfig
 *
 * @brief				-
 *
 * @param[in]			- IRQNumber
 * @param[in]			- Enable or Disable
 *
 * @return				- none
 *
 * @Note 				- I2C IRQ configure priority function
 */
void I2C_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority)
{
	//1. first lets find out the ipr register
	uint8_t iprx = IRQNumber / 4;
	uint8_t iprx_section  = IRQNumber % 4;

	// !! 16 programmable priority levels (4 bits of interrupt priority are used) Cf. RM 10.1
	// only 4 MSBits are implemented!

	uint8_t shift_amount = (8 * iprx_section) + (8 - NO_PR_BITS_IMPLEMENTED);
	*(NVIC_PR_BASE_ADDR + iprx) |= (IRQPriority << shift_amount);
}

/****************************************************************
 * @fn					- I2C_MasterSendDataIT
 *
 * @brief				-
 *
 * @param[in]			- Base address of the I2C peripheral
 * @param[in]			- Base address of the Tx buffer
 * @param[in]			- Length of the Tx buffer
 * @param[in]			- Slave address
 * @param[in]			- Repeated Start
 *
 * @return				- uint8_t
 *
 * @Note 				- None blocking interrupt based I2C transmission
 */
uint8_t I2C_MasterSendDataIT(I2C_Handle_t *pI2CHandle,uint8_t *pTxbuffer, uint32_t Len, uint8_t SlaveAddr, uint8_t Sr)
{
    uint8_t busystate = pI2CHandle->TxRxState;

    // Check transmission and receive state
	if( (busystate != I2C_BUSY_IN_TX) && (busystate != I2C_BUSY_IN_RX))
	{
		pI2CHandle->pTxBuffer = pTxbuffer;
		pI2CHandle->TxLen = Len;
		pI2CHandle->TxRxState = I2C_BUSY_IN_TX;
		pI2CHandle->DevAddr = SlaveAddr;
        pI2CHandle->Mode = I2C_MODE_MASTER;
        pI2CHandle->Sr = Sr;

        // Send the address of the slave with r/nw bit set to w(0) (total 8 bits )
	    I2C_ExecuteAddressPhaseWrite(pI2CHandle->pI2Cx, pI2CHandle->DevAddr);

		//Clear automatic end mode bit to software end mode (TC flag is set when NBYTES data are transferred, stretching SCL low)
		pI2CHandle->pI2Cx->CR2 &= ~(1 << I2C_CR2_AUTOEND);
		//Set the number of bytes to be transmitted
		pI2CHandle->pI2Cx->CR2 |= (pI2CHandle->TxLen << I2C_CR2_NBYTES);

        //Implement code to Generate START condition
		I2C_GenerateStartCondition(pI2CHandle->pI2Cx);

        //enable TXIE, TCIE, STOPIE interrupt control Bits
		pI2CHandle->pI2Cx->CR1 |= ( 1 << I2C_CR1_TXIE);
        pI2CHandle->pI2Cx->CR1 |= ( 1 << I2C_CR1_TCIE);
        pI2CHandle->pI2Cx->CR1 |= ( 1 << I2C_CR1_STOPIE);

        //enable ERRIE interrupt control Bit
		pI2CHandle->pI2Cx->CR1 |= ( 1 << I2C_CR1_ERRIE);
	}

	return busystate;
}

/****************************************************************
 * @fn					- I2C_MasterReceiveDataIT
 *
 * @brief				-
 *
 * @param[in]			- Base address of the I2C peripheral
 * @param[in]			- Base address of the Tx buffer
 * @param[in]			- Length of the Tx buffer
 * @param[in]			- Slave address
 * @param[in]			- Repeated Start
 *
 * @return				- uint8_t
 *
 * @Note 				- None blocking interrupt based I2C receive
 */
uint8_t I2C_MasterReceiveDataIT(I2C_Handle_t *pI2CHandle, uint8_t *pRxbuffer, uint8_t Len, uint8_t SlaveAddr, uint8_t Sr)
{
    uint8_t busystate = pI2CHandle->TxRxState;
    // Check transmission and receive state
	if( (busystate != I2C_BUSY_IN_TX) && (busystate != I2C_BUSY_IN_RX))
	{
		pI2CHandle->pRxBuffer = pRxbuffer;
		pI2CHandle->RxLen = Len;
		pI2CHandle->TxRxState = I2C_BUSY_IN_RX;
		pI2CHandle->RxSize = Len;
		pI2CHandle->DevAddr = SlaveAddr;
		pI2CHandle->Mode = I2C_MODE_MASTER;
		pI2CHandle->Sr = Sr;

		// Send the address of the slave with r/nw bit set to r(1) (total 8 bits )
		I2C_ExecuteAddressPhaseRead(pI2CHandle->pI2Cx,pI2CHandle->DevAddr);
		//Clear automatic end mode bit to software end mode (TC flag is set when NBYTES data are transferred, stretching SCL low)
		pI2CHandle->pI2Cx->CR2 &= ~(1 << I2C_CR2_AUTOEND);
		//Set the number of bytes to be transmitted
		pI2CHandle->pI2Cx->CR2 |= (pI2CHandle->TxLen << I2C_CR2_NBYTES);

        //Implement code to Generate START condition
		I2C_GenerateStartCondition(pI2CHandle->pI2Cx);

		//enable RXIE, STOPIE, TCIE Control Bits
		pI2CHandle->pI2Cx->CR1 |= ( 1 << I2C_CR1_RXIE);
		pI2CHandle->pI2Cx->CR1 |= ( 1 << I2C_CR1_STOPIE);
		pI2CHandle->pI2Cx->CR1 |= ( 1 << I2C_CR1_TCIE);

		//enable ERRIE Control Bit
		pI2CHandle->pI2Cx->CR1 |= ( 1 << I2C_CR1_ERRIE);

	}

	return busystate;
}

void I2C_CloseSendData(I2C_Handle_t *pI2CHandle)
{
    //disable TXIE, STOPIE, TCIE Control Bits
    pI2CHandle->pI2Cx->CR1 &= ~( 1 << I2C_CR1_TXIE);
    pI2CHandle->pI2Cx->CR1 &= ~( 1 << I2C_CR1_STOPIE);
    pI2CHandle->pI2Cx->CR1 &= ~( 1 << I2C_CR1_TCIE);

	pI2CHandle->TxRxState = I2C_READY;
    pI2CHandle->pTxBuffer = NULL;
    pI2CHandle->TxLen = 0;}


void I2C_CloseReceiveData(I2C_Handle_t *pI2CHandle)
{
    //disable RXIE, STOPIE, TCIE, NACKIE Control Bits
    pI2CHandle->pI2Cx->CR1 &= ~( 1 << I2C_CR1_RXIE);
    pI2CHandle->pI2Cx->CR1 &= ~( 1 << I2C_CR1_STOPIE);
    pI2CHandle->pI2Cx->CR1 &= ~( 1 << I2C_CR1_TCIE);

	pI2CHandle->TxRxState = I2C_READY;
	pI2CHandle->pRxBuffer = NULL;
	pI2CHandle->RxLen = 0;
	pI2CHandle->RxSize = 0;
}

/****************************************************************
 * @fn					- I2C_EV_IRQHandling
 *
 * @brief				-
 *
 * @param[in]			- Pointer to the I2C handle
 *
 * @return				- none
 *
 * @Note 				- none
 */
void I2C_EV_IRQHandling(I2C_Handle_t *pI2CHandle)
{
    uint32_t temp1, temp2;
    // Handle for interrupt generated by ADDR event
    temp1 = pI2CHandle->pI2Cx->CR1 & (1 << I2C_CR1_ADDRIE);
    temp2 = pI2CHandle->pI2Cx->ISR & (1 << I2C_ISR_ADDR);
    if (temp1 && temp2)
    {
        // clear flag by setting the ADDRCF bit:
        pI2CHandle->pI2Cx->ICR |= (1 << I2C_ICR_ADDRCF);
        /* Enable Address Acknowledge */
        pI2CHandle->pI2Cx->CR2 &= ~(1 << I2C_CR2_NACK);
    }

    // Handle for interrupt generated by received NACK event
    temp1 = pI2CHandle->pI2Cx->CR1 & (1 << I2C_CR1_NACKIE);
    temp2 = pI2CHandle->pI2Cx->ISR & (1 << I2C_ISR_NACKF);
    if (temp1 && temp2)
    {
        // clear flag by setting the NACKCF bit:
        pI2CHandle->pI2Cx->ICR |= (1 << I2C_ICR_NACKCF);

