Raziz1/STM32F767ZI_Driver/drivers/Src/STM32F767ZI_i2c_driver.c
        I2C_ApplicationEventCallback(pI2CHandle,I2C_EV_NACK);
    }

    // Handle for interrupt generated by TC event
    temp1 = pI2CHandle->pI2Cx->CR1 & (1 << I2C_CR1_TCIE);
    temp2 = pI2CHandle->pI2Cx->ISR & (1 << I2C_ISR_TC);
    if (temp1 && temp2)
    {
            //1. generate the STOP condition
            if(pI2CHandle->Sr == I2C_DISABLE_SR)
            {
                I2C_GenerateStopCondition(pI2CHandle->pI2Cx);
            }

            // 2. reset all the member elements of the handle structure.
            I2C_CloseSendData(pI2CHandle);

            pI2CHandle->pI2Cx->CR2 = 0x0; // clear CR2 register

    }

    // Handle for interrupt generated by STOPF event
    temp1 = pI2CHandle->pI2Cx->CR1 & (1 << I2C_CR1_STOPIE);
    temp2 = pI2CHandle->pI2Cx->ISR & (1 << I2C_ISR_STOPF);
    if (temp1 && temp2)
    {
        // STOPF flag is set
        // - set by hardware when a Stop condition is detected.
        // - cleared by software by setting the STOPCF bit:
        pI2CHandle->pI2Cx->ICR |= (1 << I2C_ICR_STOPCF);

        //Notify the application that STOP is detected
        //I2C_ApplicationEventCallback(pI2CHandle, I2C_EV_STOP);
    }

    // Handle for interrupt generated by TXIS event
    temp1 = pI2CHandle->pI2Cx->CR1 & (1 << I2C_CR1_TXIE);
    temp2 = pI2CHandle->pI2Cx->ISR & (1 << I2C_ISR_TXIS);
    if (temp1 && temp2)
    {
        // TXIS flag is set

        //check for device mode
        if (pI2CHandle->Mode == I2C_MODE_MASTER)
        {
            // master: We have to do the data transmission
            if(pI2CHandle->TxRxState == I2C_BUSY_IN_TX)
            {
                if (pI2CHandle->TxLen > 0)
                {
                    // 1. load the data in TXDR
                    pI2CHandle->pI2Cx->TXDR = *(pI2CHandle->pTxBuffer);
                    // 2. decrement TxLen
                    pI2CHandle->TxLen--;
                    // 3. increment buffer address
                    pI2CHandle->pTxBuffer++;
                }
            }
        }
        else
        {
            //slave
            // check that slave is in transmitter mode (DIR bit set in ISR register)
            if (pI2CHandle->pI2Cx->ISR & (1<<I2C_ISR_DIR))
            {
                I2C_ApplicationEventCallback(pI2CHandle, I2C_EV_DATA_REQ);
            }
        }
    }
    // Handle for interrupt generated by RXNE event
    temp1 = pI2CHandle->pI2Cx->CR1 & (1 << I2C_CR1_RXIE);
    temp2 = pI2CHandle->pI2Cx->ISR & (1 << I2C_ISR_RXNE);
    if (temp1 && temp2)
    {
        // RXNE flag is set
        //check for device mode
        if (pI2CHandle->Mode == I2C_MODE_MASTER)
        {
            // master mode
            if(pI2CHandle->TxRxState == I2C_BUSY_IN_RX)
            {
                if (pI2CHandle->RxLen > 0)
                {
                    // 1. read RXDR data into buffer
                    *pI2CHandle->pRxBuffer = pI2CHandle->pI2Cx->RXDR;
                    // 2. decrement RxLen
                    pI2CHandle->RxLen--;
                    // 3. increment buffer address
                    pI2CHandle->pRxBuffer++;
                }

                if(pI2CHandle->RxLen == 0)
                {
                    //1. generate the stop condition
                    if(pI2CHandle->Sr == I2C_DISABLE_SR){
                        I2C_GenerateStopCondition(pI2CHandle->pI2Cx);
                    }

                    //2 . Close the I2C rx
                    I2C_CloseReceiveData(pI2CHandle);

                    //3. Notify the application
                    I2C_ApplicationEventCallback(pI2CHandle,I2C_EV_RX_CMPLT);

                    pI2CHandle->pI2Cx->CR2 = 0x0; // clear CR2 register
                }

            }
        }
        else
        {
            // slave mode
            // check that slave is in receiver mode (DIR bit reset in ISR register)
            if (!(pI2CHandle->pI2Cx->ISR & (1<<I2C_ISR_DIR)))
            {
                I2C_ApplicationEventCallback(pI2CHandle, I2C_EV_DATA_RCV);
            }
        }
    }
}

/****************************************************************
 * @fn					- I2C_ER_IRQHandling
 *
 * @brief				-
 *
 * @param[in]			- Pointer to the I2C handle
 *
 * @return				- none
 *
 * @Note 				- none
 */
void I2C_ER_IRQHandling(I2C_Handle_t *pI2CHandle)
{
    uint32_t temp1,temp2;

    //Know the status of ERRIE control bit in CR1
    temp2 = (pI2CHandle->pI2Cx->CR1) & ( 1 << I2C_CR1_ERRIE);


    /***********************Check for Bus error************************************/
    temp1 = (pI2CHandle->pI2Cx->ISR) & ( 1<< I2C_ISR_BERR);
    if(temp1  && temp2 )
    {
        //This is Bus error

        //clear the bus error flag
        pI2CHandle->pI2Cx->ICR |= ( 1 << I2C_ICR_BERRCF);

        //notify the application about the error
        I2C_ApplicationEventCallback(pI2CHandle,I2C_ERROR_BERR);
    }

    /***********************Check for arbitration lost error************************************/
    temp1 = (pI2CHandle->pI2Cx->ISR) & ( 1<< I2C_ISR_ARLO);
    if(temp1  && temp2)
    {
        //This is arbitration lost error

        //clear the arbitration lost error flag
        pI2CHandle->pI2Cx->ICR |= ( 1 << I2C_ICR_ARLOCF);

        //notify the application about the error
        I2C_ApplicationEventCallback(pI2CHandle,I2C_ERROR_ARLO);
    }

    /***********************Check for Overrun/underrun error************************************/
    temp1 = (pI2CHandle->pI2Cx->ISR) & ( 1<< I2C_ISR_OVR);
    if(temp1  && temp2)
    {
        //This is Overrun/underrun error

        //clear the Overrun/underrun error flag
        pI2CHandle->pI2Cx->ICR |= ( 1 << I2C_ICR_OVRCF);

        //notify the application about the error
        I2C_ApplicationEventCallback(pI2CHandle,I2C_ERROR_OVR);
    }

    /***********************Check for Time out error************************************/
    temp1 = (pI2CHandle->pI2Cx->ISR) & ( 1<< I2C_ISR_TIMEOUT);
    if(temp1  && temp2)
    {
        //This is Time out error

        //clear the Time out error flag
        pI2CHandle->pI2Cx->ICR |= ( 1 << I2C_ICR_TIMEOUTCF);

        //notify the application about the error
        I2C_ApplicationEventCallback(pI2CHandle,I2C_ERROR_TIMEOUT);
    }
}

/****************************************************************
 * @fn					- I2C_SlaveEnableDisableCallbackEvents
 *
 * @brief				-
 *
 * @param[in]			- Pointer to the I2C handle
 * @param[in]			- Enable/Disable
 *
 * @return				- none
 *
 * @Note 				- none
 */
void I2C_SlaveEnableDisableCallbackEvents(I2C_RegDef_t *pI2Cx, uint8_t EnorDi)
{
    if (EnorDi == ENABLE)
    {
        //enable TXIE, RXIE, STOPIE, ADDRIE, NACKIE Control Bits
		pI2Cx->CR1 |= ( 1 << I2C_CR1_TXIE);
        pI2Cx->CR1 |= ( 1 << I2C_CR1_RXIE);
        pI2Cx->CR1 |= ( 1 << I2C_CR1_STOPIE);
        pI2Cx->CR1 |= ( 1 << I2C_CR1_ADDRIE);
        pI2Cx->CR1 |= ( 1 << I2C_CR1_NACKIE);
    }
    else
    {
        //disable TXIE, RXIE, STOPIE, ADDRIE, NACKIE Control Bits
		pI2Cx->CR1 &= ~( 1 << I2C_CR1_TXIE);
        pI2Cx->CR1 &= ~( 1 << I2C_CR1_RXIE);
        pI2Cx->CR1 &= ~( 1 << I2C_CR1_STOPIE);
        pI2Cx->CR1 &= ~( 1 << I2C_CR1_ADDRIE);
        pI2Cx->CR1 &= ~( 1 << I2C_CR1_NACKIE);
    }
}


/****************************************************************
 * @fn					- I2C_SlaveSendData
 *
 * @brief				-
 *
 * @param[in]			- Pointer to the I2C handle
 * @param[in]			- Data to send byte by byte
 *
 * @return				- none
 *
 * @Note 				- none
 */
void I2C_SlaveSendData(I2C_RegDef_t *pI2Cx, uint8_t data)
{
    pI2Cx->TXDR = data;
}

/****************************************************************
 * @fn					- I2C_SlaveReceiveData
 *
 * @brief				-
 *
 * @param[in]			- Pointer to the I2C handle
 *
 * @return				- none
 *
 * @Note 				- none
 */
uint8_t I2C_SlaveReceiveData(I2C_RegDef_t *pI2Cx)
{
    return (uint8_t)pI2Cx->RXDR;
}
